# GetProjectUserNames

## Description
Get a list of userids that are part of the current project.

```pascal
FUNCTION GetProjectUserNames(VAR userArray : ARRAY) : BOOLEAN;
```

```python

def vs.GetProjectUserNames():
    return (BOOLEAN, userArray)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|userArray|ARRAY|Array of userids as strings|

## Returns
True on success, false on failure or not Project Sharing file.

## See Also
VS Functions:
GetProjectUser

## Version
Availability: from Vectorworks 2016
## Category
* Project Sharing